# TriangulationInterfaceForTriangulatedShellComponent Class

---
This class is used to call FacetingUtils::convertTrianglesToQuads with a triangulation defined by a TriangulatedShellComponent.
SystemObject Autodesk.Revit.DBTriangulationInterface Autodesk.Revit.DBTriangulationInterfaceForTriangulatedShellComponent
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class TriangulationInterfaceForTriangulatedShellComponent : TriangulationInterface

    Public Class TriangulationInterfaceForTriangulatedShellComponent
    	Inherits TriangulationInterface

    public ref class TriangulationInterfaceForTriangulatedShellComponent : public TriangulationInterface

    type TriangulationInterfaceForTriangulatedShellComponent =
        class
            inherit TriangulationInterface
        end
The TriangulationInterfaceForTriangulatedShellComponent type exposes the following members.
| Name| Description
---|---|---
| TriangulationInterfaceForTriangulatedShellComponent|  Constructs an interface object for a TriangulatedShellComponent.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from TriangulationInterface)
Top
| Name| Description
---|---|---
| Dispose| (Inherited from TriangulationInterface)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
Compare to TriangulationInterfaceForTriangulatedSolidOrShell, which treats with the entire solid or shell as a single triangulated structure.
#### Reference
Autodesk.Revit.DB Namespace